use('squad-help-dev');

// db.messages.insertMany([
//   {
//     sender: 1,
//     body: 'Паровоз у дорозі!',
//   },
//   {
//     sender: 2,
//     body: 'пАРОВОЗ приїхав!',
//   },
//   {
//     sender: 1,
//     body: 'ПАРОВОЗ швидкий!',
//   },
//   {
//     sender: 2,
//     body: 'парОвоз поїхав',
//   },
//   {
//     sender: 1,
//     body: 'Ще один Паровоз прибув!',
//   },
//   {
//     sender: 2,
//     body: 'паровоз гуде вдалині!',
//   },
//   {
//     sender: 1,
//     body: 'ПАРОВОЗ великий!',
//   },
//   {
//     sender: 2,
//     body: 'пАрОвОз старий але надійний!',
//   },
//   {
//     sender: 1,
//     body: 'Паровоз їде на вокзал!',
//   },
//   {
//     sender: 2,
//     body: 'Маленький пАрОвОзик!',
//   },
//   {
//     sender: 1,
//     body: 'Привіт! Як справи?',
//   },
//   {
//     sender: 2,
//     body: 'Дуже цікава розмова!',
//   },
//   {
//     sender: 1,
//     body: 'Що плануєш на вихідні?',
//   },
//   {
//     sender: 2,
//     body: 'Сьогодні гарна погода!',
//   },
//   {
//     sender: 1,
//     body: 'Яка твоя улюблена книга?',
//   },
// ]);

db.messages.aggregate([
  {
    $match: {
      body: { $regex: /паровоз/i },
    },
  },
  {
    $count: 'totaldocs',
  },
]);
